test/tests/postprocessors/side_advective_flux_integral/foam/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

vertices
(
    ( 0.0  0.0  0.0 )
    ( 10.0  0.0  0.0 )
    ( 10.0  1.0  0.0 )
    ( 0.0  1.0  0.0 )

    ( 0.0  0.0  1.0)
    ( 10.0  0.0  1.0)
    ( 10.0  1.0  1.0)
    ( 0.0  1.0  1.0)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 1 1) simpleGrading (25 1 1)
);

boundary
(

    // interface
    left
    {
        type wall;
        faces
        (
            (4 7 3 0)
        );
    }

    right
    {
        type wall;
        faces
        (
            (6 5 1 2)
        );
    }

    top
    {
        type wall;
        faces
        (
            (2 3 7 6)
        );
    }

    front
    {
        type wall;
        faces
        (
            (3 2 1 0)
        );
    }

    bottom
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }

    back
    {
        type wall;
        faces
        (
            (4 5 6 7)
        );
    }

);
