test/tests/postprocessors/side_advective_flux_integral/foam/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    rho
    {
        solver          diagonal;
    }

    rhoFinal
    {
        $rho;
    }


    "(U|h|p_rgh)"
    {
        solver           PBiCGStab;
        preconditioner   DILU;
        tolerance        1e-8;
        relTol           1e-8;
    }

    "(U|h|p_rgh)Final"
    {
        $U;
        tolerance        1e-8;
        relTol           1e-8;
    }
}

PIMPLE
{
    momentumPredictor   yes;
    pRefCell            0;
    pRefValue           0;
}

relaxationFactors
{
    equations
    {
        h               1;
        U               1;
    }
}

// ************************************************************************* //
